{
  "python": {
    "icon": "py.svg",
    "content": "",
    "title": "Complete Python Code snippet for quick reference",
    "description": "Key Topics Covered:\nBasics: Arithmetic, Variables, Lists, Conditionals, Loops, Functions.\nIntermediate: Dictionaries, String manipulation, List comprehensions, Error handling, Lambda functions, File handling.\nAdvanced: OOP, Generators, Decorators, JSON."
  },
  "sql": {
    "icon": "sql.svg",
    "content": "",
    "title": "Complete SQL Code Examples for quick reference",
    "description": "Key Topics Covered:\nBasics: Creating tables, inserting, updating, deleting data, and basic SELECT queries.\nIntermediate: Joins, aggregate functions, grouping, filtering, pattern matching, and subqueries.\nAdvanced: Union operations, views, indexes, transactions, advanced joins, conditional logic, and stored procedures."
  },
  "git": {
    "icon": "git.svg",
    "content": "",
    "title": "Complete GIT Version Control syntax for quick reference",
    "description": "Key Topics Covered:\nBasics: Initializing repositories, checking status, adding files, committing, cloning, and viewing history.\nIntermediate: Branching, merging, deleting branches, stashing changes, working with remote repositories, and undoing changes.\nAdvanced: Rebasing, cherry-picking commits, tagging, resetting and reverting commits, resolving merge conflicts, and squashing commits."
  },
  "linux_shell": {
    "icon": "linux.svg",
    "content": "",
    "title": "Complete Linux Shell commands for quick reference",
    "description": "Key Topics Covered:\nBasics: Navigating directories, creating/removing files, viewing file contents, file permissions, and basic output redirection.\nIntermediate: Piping commands, using variables, shell loops, conditionals, processes, and file searches.\nAdvanced: Functions, cron jobs, shell scripting, AWK, Sed, networking commands, and file compression/archiving."
  },
  "java": {
    "icon": "java.svg",
    "content": "",
    "title": "Complete Java language examples for quick reference",
    "description": "Key Topics Covered:\nBasics: Printing to the console, variables, arithmetic operations, conditional statements, loops, and arrays.\nIntermediate: Methods, classes and objects, switch-case, strings, and exception handling.\nAdvanced: Inheritance, polymorphism, abstract classes, interfaces, collections (ArrayList), and file handling."
  },
  "selenium": {
    "icon": "selenium.svg",
    "content": "",
    "title": "Selenium Syntaxes and examples for quick reference",
    "description": "Basic automation, handling forms, browser windows, working with alerts, screenshots, dropdowns, and dynamic content."
  },
  "pandas": {
    "icon": "pandas.svg",
    "content": "",
    "title": "Python pandas module examples for quick reference",
    "description": "Creating DataFrames, selecting columns, filtering data, handling missing data, merging DataFrames, pivot tables, sorting, etc."
  },
  "c": {
    "icon": "c.svg",
    "content": "",
    "title": "Complete C language Syntax and examples for quick reference",
    "description": "Basic operations, arrays, pointers, file handling, functions, and structures."
  },
  "cpp": {
    "icon": "cpp.svg",
    "content": "",
    "title": "Complete C++ language Syntax and examples for quick reference",
    "description": "Classes, objects, file handling, and functions, along with advanced concepts like inheritance."
  },
  "csharp": {
    "icon": "csharp.svg",
    "content": "",
    "title": "Complete C# [C Sharp] language Syntax and examples for quick reference",
    "description": "Key Topics Covered:\nBasics: Printing to the console, working with variables, arithmetic operations, and conditional statements.\nIntermediate: Functions, loops, arrays, object-oriented programming (OOP) basics like classes, and exception handling.\nAdvanced: Inheritance, polymorphism, interfaces, LINQ, file handling, delegates, lambda expressions, and async/await for asynchronous programming."
  }
}